{"categories": ["Asian", "Chinese", "Side Dish", "Noodles", "Italian", "Main Course"], "recipes": [{"name": "Supreme Soy Noodles", "categories": ["Asian", "Chinese", "Side Dish", "Noodles"], "ingredients": "500 g / 1 lb fresh yellow or white noodles , medium thickness (see Note 1)\n▢2 tbsp oil (vegetable, canola, or peanut)\n▢8 green onions , ends trimmed, cut into 7cm / 2.5” lengths, white parts separated from green parts\n▢2 garlic cloves , finely chopped\nSOY-SAUCE NOODLE SAUCE:\n▢2 tsp sesame oil (toasted sesame oil)\n▢2 tsp light soy sauce (Note 2)\n▢1 tbsp dark soy sauce (Note 2)\n▢1 tbsp oyster sauce (Note 3)\n▢1 tbsp mirin (Note 4 for subs)", "instructions": "Mix Sauce ingredients in a small bowl.\nCook noodles per packet directions (see cooking tip in Notes). Drain and give it a quick rinse under tap water to stop them sticking together as they sit.\nSauté garlic – Heat oil in a large deep non-stick skillet or wok over high heat. Add white part of green onions, stir for 20 seconds. Add garlic and stir for 10 seconds or until light golden.\nAdd noodles, sauce – Add noodles then pour over Sauce. Toss for 1 1/2 minutes. Don’t skimp on this step, the flavour is so much better when the noodles caramelise slightly. If your stove is a bit weak, you might need to go longer!\nGreen onions – Add green onion and toss until just wilted, about 20 seconds. Serve immediately", "notes": "1. Noodles – Fresh noodles work best here, medium thickness. I used Shanghai noodles (white, see photo in post). Hokkien or lo mein noodles are also ideal.\nIf using dried noodles (egg noodles, rice noodles, ramen noodles, even spaghetti!) – use 250g / 8 oz uncooked weight (once cooked, it will be around 700g / 1.2 lb which is the cooked weight of 500g/1 lb fresh noodles).\n2. Soy sauce subs – Light soy sauce can be substitute with all-purpose soy sauce. Dark soy gives the noodles colour and flavour. It can be substituted for more light soy sauce and will still be tasty, but noodles won’t be as dark and slightly less intense in flavour. See here for more info on different soy types and subs.\n3. Oyster sauce provides flavour and sweetness, don’t skip it. Subs: These days you can get even vegetarian oyster sauce, even at some large grocery stores! Hoisin is an acceptable sub though it adds a five spice flavour (still tasty, just different!)\n4. Mirin – Substitute with Chinese cooking wine OR dry sherry + 1 tsp white sugar (mirin is sweeter). For non-alcoholic, substitute with 1 tbsp extra oyster sauce.\n5. Leftovers will keep for 4 to 5 days in the fridge. Freezing not recommended.\nTIP: Cooking noodles\nCook the noodles per the packet directions. Some require only soaking, most require boiling. For boiled noodles, start the timer when you first drop the noodles into the boiling water, not from when it comes back up to the boil. Loosen noodles as they cook with tongs or chopsticks. Rinse under cold tap water so they don’t clump into an unworkable block as they cool, and shake off excess water before using."}, {"name": "SPAGHETTI  by Lil’ Luna", "categories": ["Italian", "Main Course"], "ingredients": "1 pound ground beef\n▢2 cubes beef bouillion\n▢1 (8-ounce) can tomato sauce\n▢1 (6-ounce) can tomato paste\n▢black pepper to taste\n▢2 cups hot water\n▢2 teaspoons sugar white or brown\n▢½ teaspoon dried basil\n▢½ teaspoon dried oregano\n▢dash of garlic\n▢16 ounces spaghetti noodles", "instructions": "Brown the ground beef in a large skillet. (drain excess fat)\nOnce cooked, throw in salt, pepper, tomato sauce and paste, water (with the bouillon cubes in it), sugar, basil, oregano, and garlic. Simmer on low for an hour.\nA few minutes before the hour is done, cook box of spaghetti noodles as directed on package.\nOnce the noodles are cooked, drain and add to spaghetti sauce. ENJOY!", "notes": "Nutrition\nCalories: 200kcal, Carbohydrates: 38g, Protein: 7g, Fat: 2g, Sodium: 959mg, Potassium: 568mg, Fiber: 3g, Sugar: 10g, Vitamin A: 690IU, Vitamin C: 11.3mg, Calcium: 119mg, Iron: 3.5mg"}]}